iPig/src/Reports/ЛистОтъема/ЛистОтъема.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ЛистОтъема</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧОтъем</name>
    <attributes>
      <name>НомерОпороса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЖивотного</name>
      <type>
        <types>CatalogRef.НомерЖивотного</types>
      </type>
    </attributes>
    <attributes>
      <name>Дни</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоследнегоСобытия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтъема</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

iPig/src/InformationRegisters/ПоследнееСобытие/ПоследнееСобытие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоследнееСобытие</name>
  <attributes>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УшнойВыщип</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖивотногоХряк</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПоследнегоСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоследнееСобытие</name>
    <type>
      <types>EnumRef.ПоследнееСобытие</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/Enums/ПоследнееСобытие/ПоследнееСобытие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПоследнееСобытие</name>
  <enumValues>
    <name>Случка</name>
  </enumValues>
  <enumValues>
    <name>УЗИ</name>
  </enumValues>
  <enumValues>
    <name>Опорос</name>
  </enumValues>
  <enumValues>
    <name>Отъем</name>
  </enumValues>
  <enumValues>
    <name>Ввод</name>
  </enumValues>
  <enumValues>
    <name>Выбытие</name>
  </enumValues>
  <enumValues>
    <name>Аборт</name>
  </enumValues>
</mdclass:Enum>

iPig/src/Reports/ЛистОтъема/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отчет.Период.Вариант = ВариантСтандартногоПериода.ЭтаНеделя;
	ПериодПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодПриИзмененииНаСервере()
	Отчет.ТЧОтъем.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ПоследнееСобытиеРег.НомерОпороса КАК НомерОпороса,
				   |	ПоследнееСобытиеРег.НомерЖивотного КАК НомерЖивотного,
				   |	РАЗНОСТЬДАТ(ПоследнееСобытиеРег.ДатаПоследнегоСобытия, &КонецПериода, ДЕНЬ) КАК Дни,
				   |	ПоследнееСобытиеРег.ДатаПоследнегоСобытия КАК ДатаПоследнегоСобытия
				   |ИЗ
				   |	РегистрСведений.ПоследнееСобытие КАК ПоследнееСобытиеРег
				   |ГДЕ
				   |	ПоследнееСобытиеРег.ПоследнееСобытие = ЗНАЧЕНИЕ(Перечисление.ПоследнееСобытие.Опорос)
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	Дни";
	Запрос.УстановитьПараметр("КонецПериода", Отчет.Период.ДатаОкончания);
	Отчет.ТЧОтъем.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПериодПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПредварительныйПросмотр(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьПредварительныйПросмотр(ТабДок);
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Защита 				= Ложь;
	ТабДок.ТолькоПросмотр 		= Ложь;
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб			= Истина;
	ТабДок.Показать();
КонецПроцедуры
&НаСервере
Процедура ПечатьПредварительныйПросмотр(ТабДок)
	Макет = Отчеты.ЛистОтъема.ПолучитьМакет("ПредварительныйПросмотр");

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьШапка.Параметры.Период = Формат(Отчет.Период.ДатаНачала, "ДФ=dd.MM.yy") + " - " + Формат(
		Отчет.Период.ДатаОкончания, "ДФ=dd.MM.yy");
	ОбластьШапка.Параметры.КоличествоЖивотных = Отчет.ТЧОтъем.Количество();
	ТабДок.Вывести(ОбластьШапка);
	//
	//ЗаписиСписка = ПолучитьТЗИзСписка(); 
	////	ЗаписиСписка.Сортировать("ДатаСлучки");
	Для Каждого СтрЗаписи Из Отчет.ТЧОтъем Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрЗаписи);
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;
КонецПроцедуры
